In [12]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch','Ticket','Cabin', 'Embarked'],axis='columns' , inplace=True)       
df

     Survived  Pclass     Sex   Age     Fare
0           0       3    male  22.0   7.2500
1           1       1  female  38.0  71.2833
2           1       3  female  26.0   7.9250
3           1       1  female  35.0  53.1000
4           0       3    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886         0       2    male  27.0  13.0000
887         1       1  female  19.0  30.0000
888         0       3  female   NaN  23.4500
889         1       1    male  26.0  30.0000
890         0       3    male  32.0   7.7500

[891 rows x 5 columns]

In [14]:
target = df.Survived
inputs= df.drop('Survived' , axis='columns')

In [15]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [16]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.drop('Sex',axis='columns' , inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [17]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [18]:
inputs.Age[:12]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
Name: Age, dtype: float64

In [33]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [34]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test= train_test_split(inputs,target,test_size=0.2)

In [35]:
print(len(x_train), len(x_test))

712 179

In [39]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [40]:
model.fit(x_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [41]:
model.score(x_test,y_test)

0.8268156424581006

In [43]:
model.predict(x_test[:10])

array([1, 0, 1, 0, 1, 0, 1, 0, 0, 1], dtype=int64)

In [45]:
model.predict_proba(x_test[:10])

array([[0.00320998, 0.99679002],
       [0.98768804, 0.01231196],
       [0.05026558, 0.94973442],
       [0.87901112, 0.12098888],
       [0.04654443, 0.95345557],
       [0.98783758, 0.01216242],
       [0.0027513 , 0.9972487 ],
       [0.98768737, 0.01231263],
       [0.98825582, 0.01174418],
       [0.0095209 , 0.9904791 ]])